In [7]:
import pandas as pd

In [8]:
import numpy as np

In [9]:
pd.__version__

'1.2.4'

In [10]:
from pandas import Series, DataFrame

In [12]:
series = pd.Series(['Choco','Vanila','Strewberry'],index=[1,2,3])

In [13]:
series.name = "icecream"

In [45]:
frame =pd.DataFrame(np.arange(0,15).reshape(3,5),index=['choco','Vanila','Strawberry'])

In [46]:
frame.columns=list('12345')

In [47]:
frame

             1   2   3   4   5
choco        0   1   2   3   4
Vanila       5   6   7   8   9
Strawberry  10  11  12  13  14

In [48]:
frame = frame.reindex(list('54321'), axis=1)
frame

             5   4   3   2   1
choco        4   3   2   1   0
Vanila       9   8   7   6   5
Strawberry  14  13  12  11  10

In [51]:
frame.loc['choco','2']

1

In [53]:
frame.loc[['choco','Vanila'],['5','3']]

        5  3
choco   4  2
Vanila  9  7

In [54]:
frame.iloc[1,2]

7

In [58]:
frame.iloc[1:3,2:4]

             3   2
Vanila       7   6
Strawberry  12  11

In [59]:
frame.loc['blueberry']=range(1,6)
frame

             5   4   3   2   1
choco        4   3   2   1   0
Vanila       9   8   7   6   5
Strawberry  14  13  12  11  10
blueberry    1   2   3   4   5

In [60]:
frame.where(frame > 10, other = 15)

             5   4   3   2   1
choco       15  15  15  15  15
Vanila      15  15  15  15  15
Strawberry  14  13  12  11  15
blueberry   15  15  15  15  15

In [61]:
frame

             5   4   3   2   1
choco        4   3   2   1   0
Vanila       9   8   7   6   5
Strawberry  14  13  12  11  10
blueberry    1   2   3   4   5

In [ ]:
frame.loc['d'],drop